ElektorLabs/Arduino/source/1.1.0/boards.txt
# Elektor Platino, eRIC Nitro, Black Whiteboard R4 Board Configuration
#
# For more information see:
# - https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5---3rd-party-Hardware-specification
# - https://github.com/arduino/Arduino/wiki/Arduino-Hardware-Cores-migration-guide-from-1.0-to-1.6
#

#######################################################################
# Black Whiteboard (or White Blackboard) R4 is a Uno with an ATmega328pb.
#######################################################################

blackwhite_r4.name=Black Whiteboard R4
blackwhite_r4.upload.tool=arduino:avrdude
blackwhite_r4.upload.protocol=arduino
blackwhite_r4.upload.maximum_size=32256
blackwhite_r4.upload.speed=115200
blackwhite_r4.bootloader.low_fuses=0xff
blackwhite_r4.bootloader.high_fuses=0xde
blackwhite_r4.bootloader.extended_fuses=0x05
blackwhite_r4.bootloader.file=R4/optiboot_atmega328.hex
blackwhite_r4.bootloader.unlock_bits=0x3f
blackwhite_r4.bootloader.lock_bits=0x0f
blackwhite_r4.bootloader.tool=arduino:avrdude
blackwhite_r4.build.mcu=atmega328pb
blackwhite_r4.build.f_cpu=16000000L
blackwhite_r4.build.core=arduino:arduino
blackwhite_r4.build.variant=R4
blackwhite_r4.build.board=AVR_R4

#######################################################################
# eRIC Nitro is similar to a Pro or Pro Mini (ATmega328, 3.3V, 8 MHz).
#######################################################################

ericnitro_r4.name=eRIC Nitro R4
ericnitro_r4.upload.tool=arduino:avrdude
ericnitro_r4.upload.protocol=arduino
ericnitro_r4.upload.maximum_size=32256
ericnitro_r4.upload.speed=57600
ericnitro_r4.bootloader.low_fuses=0xff
ericnitro_r4.bootloader.high_fuses=0xde
ericnitro_r4.bootloader.extended_fuses=0x05
ericnitro_r4.bootloader.file=eRIC-Nitro/optiboot_eric_nitro_and_p.hex
ericnitro_r4.bootloader.unlock_bits=0x3f
ericnitro_r4.bootloader.lock_bits=0x0f
ericnitro_r4.bootloader.tool=arduino:avrdude
ericnitro_r4.build.mcu=atmega328pb
ericnitro_r4.build.f_cpu=8000000L
ericnitro_r4.build.core=arduino:arduino
ericnitro_r4.build.variant=eRIC-Nitro-R4
ericnitro_r4.build.board=AVR_ERIC_NITRO

ericnitro.name=eRIC Nitro
ericnitro.upload.tool=arduino:avrdude
ericnitro.upload.protocol=arduino
ericnitro.upload.maximum_size=32256
ericnitro.upload.speed=57600
ericnitro.bootloader.low_fuses=0xff
ericnitro.bootloader.high_fuses=0xde
ericnitro.bootloader.extended_fuses=0x05
ericnitro.bootloader.file=eRIC-Nitro/optiboot_eric_nitro_and_p.hex
ericnitro.bootloader.unlock_bits=0x3f
ericnitro.bootloader.lock_bits=0x0f
ericnitro.bootloader.tool=arduino:avrdude
ericnitro.build.mcu=atmega328p
ericnitro.build.f_cpu=8000000L
ericnitro.build.core=arduino:arduino
ericnitro.build.variant=eRIC-Nitro
ericnitro.build.board=AVR_ERIC_NITRO

##################################################
# Platino with an 28-pin or 40-pin AVR
##################################################

menu.cpu=Processor

platino.name=Platino
platino.upload.tool=arduino:avrdude
platino.upload.protocol=arduino
platino.upload.speed=115200
platino.bootloader.tool=arduino:avrdude
platino.bootloader.unlock_bits=0x3f
platino.bootloader.lock_bits=0x0f
platino.build.f_cpu=16000000L
platino.build.core=Platino
platino.build.board=AVR_PLATINO

## Platino with ATmega8(A)
## ---------------------------------------------
platino.menu.cpu.atmega8=ATmega8(A)
platino.menu.cpu.atmega8.upload.maximum_size=7680
platino.menu.cpu.atmega8.bootloader.tool=avrdude_no_efuse
platino.menu.cpu.atmega8.bootloader.low_fuses=0xbf
platino.menu.cpu.atmega8.bootloader.high_fuses=0xcc
platino.menu.cpu.atmega8.bootloader.file=Platino/optiboot_platino8_and_a.hex
platino.menu.cpu.atmega8.build.mcu=atmega8
platino.menu.cpu.atmega8.build.variant=arduino:standard
platino.menu.cpu.atmega8.build.board=AVR_PLATINO_28PIN

## Platino with ATmega16(A)
## ---------------------------------------------
platino.menu.cpu.atmega16=ATmega16(A)
platino.menu.cpu.atmega16.upload.maximum_size=15872
platino.menu.cpu.atmega16.bootloader.tool=avrdude_no_efuse
platino.menu.cpu.atmega16.bootloader.low_fuses=0xbf
platino.menu.cpu.atmega16.bootloader.high_fuses=0xdc
platino.menu.cpu.atmega16.bootloader.file=Platino/optiboot_platino16_and_a.hex
platino.menu.cpu.atmega16.build.mcu=atmega16
platino.menu.cpu.atmega16.build.variant=Platino-40pin
platino.menu.cpu.atmega16.build.board=AVR_PLATINO_40PIN

## Platino with ATmega32(A)
## ---------------------------------------------
platino.menu.cpu.atmega32=ATmega32(A)
platino.menu.cpu.atmega32.upload.maximum_size=32256
platino.menu.cpu.atmega32.bootloader.tool=avrdude_no_efuse
platino.menu.cpu.atmega32.bootloader.low_fuses=0xbf
platino.menu.cpu.atmega32.bootloader.high_fuses=0xce
platino.menu.cpu.atmega32.bootloader.file=Platino/optiboot_platino32_and_32a.hex
platino.menu.cpu.atmega32.build.mcu=atmega32
platino.menu.cpu.atmega32.build.variant=Platino-40pin
platino.menu.cpu.atmega32.build.board=AVR_PLATINO_40PIN

## Platino with ATmega48, no bootloader, not working :-(yet)
## ---------------------------------------------
platino.menu.cpu.atmega48=ATmega48, no bootloader, not working
platino.menu.cpu.atmega48.upload.maximum_size=4094
platino.menu.cpu.atmega48.bootloader.low_fuses=0xff
platino.menu.cpu.atmega48.bootloader.high_fuses=0xdd
platino.menu.cpu.atmega48.bootloader.extended_fuses=0x00
platino.menu.cpu.atmega48.bootloader.file=Platino/dummy_platino48.hex
platino.menu.cpu.atmega48.build.mcu=atmega48
platino.menu.cpu.atmega48.build.variant=arduino:standard
platino.menu.cpu.atmega48.build.board=AVR_PLATINO_28PIN

## Platino with ATmega48P, no bootloader, not working :-(yet)
## ---------------------------------------------
platino.menu.cpu.atmega48p=ATmega48P, no bootloader, not working
platino.menu.cpu.atmega48p.upload.maximum_size=4094
platino.menu.cpu.atmega48p.bootloader.low_fuses=0xff
platino.menu.cpu.atmega48p.bootloader.high_fuses=0xdd
platino.menu.cpu.atmega48p.bootloader.extended_fuses=0x00
platino.menu.cpu.atmega48p.bootloader.file=Platino/dummy_platino48.hex
platino.menu.cpu.atmega48p.build.mcu=atmega48p
platino.menu.cpu.atmega48p.build.variant=arduino:standard
platino.menu.cpu.atmega48p.build.board=AVR_PLATINO_28PIN

