ElektorLabs/Arduino/source/1.1.0/boards.txt
## Platino with ATmega644P(A)
## ---------------------------------------------
platino.menu.cpu.atmega644p=ATmega644P(A)
platino.menu.cpu.atmega644p.upload.maximum_size=64512
platino.menu.cpu.atmega644p.bootloader.low_fuses=0xff
platino.menu.cpu.atmega644p.bootloader.high_fuses=0xde
platino.menu.cpu.atmega644p.bootloader.extended_fuses=0xfd
platino.menu.cpu.atmega644p.bootloader.file=Platino/optiboot_platino644p_and_644pa.hex
platino.menu.cpu.atmega644p.build.mcu=atmega644p
platino.menu.cpu.atmega644p.build.variant=Platino-40pin
platino.menu.cpu.atmega644p.build.board=AVR_PLATINO_40PIN

## Platino with ATmega1284p
## ---------------------------------------------
platino.menu.cpu.atmega1284p=ATmega1284P
platino.menu.cpu.atmega1284p.upload.maximum_size=129024
platino.menu.cpu.atmega1284p.bootloader.low_fuses=0xff
platino.menu.cpu.atmega1284p.bootloader.high_fuses=0xde
platino.menu.cpu.atmega1284p.bootloader.extended_fuses=0xfd
platino.menu.cpu.atmega1284p.bootloader.file=Platino/optiboot_platino1284p.hex
platino.menu.cpu.atmega1284p.build.mcu=atmega1284p
platino.menu.cpu.atmega1284p.build.variant=Platino-40pin
platino.menu.cpu.atmega1284p.build.board=AVR_PLATINO_40PIN

########################################
# Platino with an 28-pin or 40-pin AVR
########################################
# Without Platino library
########################################
platino_without_library.name=Platino without library
platino_without_library.upload.tool=arduino:avrdude
platino_without_library.upload.protocol=arduino
platino_without_library.upload.speed=115200
platino_without_library.bootloader.tool=arduino:avrdude
platino_without_library.bootloader.unlock_bits=0x3f
platino_without_library.bootloader.lock_bits=0x0f
platino_without_library.build.f_cpu=16000000L
platino_without_library.build.core=arduino:arduino
platino_without_library.build.board=AVR_PLATINO

## Platino with ATmega8(A)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega8=ATmega8(A)
platino_without_library.menu.cpu.atmega8.upload.maximum_size=7680
platino_without_library.menu.cpu.atmega8.bootloader.tool=avrdude_no_efuse
platino_without_library.menu.cpu.atmega8.bootloader.low_fuses=0xbf
platino_without_library.menu.cpu.atmega8.bootloader.high_fuses=0xcc
platino_without_library.menu.cpu.atmega8.bootloader.file=Platino/optiboot_platino8_and_a.hex
platino_without_library.menu.cpu.atmega8.build.mcu=atmega8
platino_without_library.menu.cpu.atmega8.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega8.build.board=AVR_PLATINO_28PIN

## Platino with ATmega16(A)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega16=ATmega16(A)
platino_without_library.menu.cpu.atmega16.upload.maximum_size=15872
platino_without_library.menu.cpu.atmega16.bootloader.tool=avrdude_no_efuse
platino_without_library.menu.cpu.atmega16.bootloader.low_fuses=0xbf
platino_without_library.menu.cpu.atmega16.bootloader.high_fuses=0xdc
platino_without_library.menu.cpu.atmega16.bootloader.file=Platino/optiboot_platino16_and_a.hex
platino_without_library.menu.cpu.atmega16.build.mcu=atmega16
platino_without_library.menu.cpu.atmega16.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega16.build.board=AVR_PLATINO_40PIN

## Platino with ATmega32(A)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega32=ATmega32(A)
platino_without_library.menu.cpu.atmega32.upload.maximum_size=32256
platino_without_library.menu.cpu.atmega32.bootloader.tool=avrdude_no_efuse
platino_without_library.menu.cpu.atmega32.bootloader.low_fuses=0xbf
platino_without_library.menu.cpu.atmega32.bootloader.high_fuses=0xce
platino_without_library.menu.cpu.atmega32.bootloader.file=Platino/optiboot_platino32_and_32a.hex
platino_without_library.menu.cpu.atmega32.build.mcu=atmega32
platino_without_library.menu.cpu.atmega32.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega32.build.board=AVR_PLATINO_40PIN

## Platino with ATmega48, no bootloader, not working :-(yet)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega48=ATmega48, no bootloader, not working
platino_without_library.menu.cpu.atmega48.upload.maximum_size=4094
platino_without_library.menu.cpu.atmega48.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega48.bootloader.high_fuses=0xdd
platino_without_library.menu.cpu.atmega48.bootloader.extended_fuses=0x00
platino_without_library.menu.cpu.atmega48.bootloader.file=
platino_without_library.menu.cpu.atmega48.build.mcu=atmega48
platino_without_library.menu.cpu.atmega48.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega48.build.board=AVR_PLATINO_28PIN

## Platino with ATmega48P, no bootloader, not working :-(yet)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega48p=ATmega48P, no bootloader, not working
platino_without_library.menu.cpu.atmega48p.upload.maximum_size=4094
platino_without_library.menu.cpu.atmega48p.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega48p.bootloader.high_fuses=0xdd
platino_without_library.menu.cpu.atmega48p.bootloader.extended_fuses=0x00
platino_without_library.menu.cpu.atmega48p.bootloader.file=
platino_without_library.menu.cpu.atmega48p.build.mcu=atmega48p
platino_without_library.menu.cpu.atmega48p.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega48p.build.board=AVR_PLATINO_28PIN

## Platino with ATmega88(A)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega88=ATmega88(A)
platino_without_library.menu.cpu.atmega88.upload.maximum_size=7680
platino_without_library.menu.cpu.atmega88.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega88.bootloader.high_fuses=0xdd
platino_without_library.menu.cpu.atmega88.bootloader.extended_fuses=0x04
platino_without_library.menu.cpu.atmega88.bootloader.file=Platino/optiboot_platino88.hex
platino_without_library.menu.cpu.atmega88.build.mcu=atmega88
platino_without_library.menu.cpu.atmega88.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega88.build.board=AVR_PLATINO_28PIN

## Platino with ATmega88P(A)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega88p=ATmega88P(A)
platino_without_library.menu.cpu.atmega88p.upload.maximum_size=7680
platino_without_library.menu.cpu.atmega88p.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega88p.bootloader.high_fuses=0xdd
platino_without_library.menu.cpu.atmega88p.bootloader.extended_fuses=0x04
platino_without_library.menu.cpu.atmega88p.bootloader.file=Platino/optiboot_platino88p_and_pa.hex
platino_without_library.menu.cpu.atmega88p.build.mcu=atmega88p
platino_without_library.menu.cpu.atmega88p.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega88p.build.board=AVR_PLATINO_28PIN

## Platino with ATmega164, all variants
## ---------------------------------------------
## The definition of the ATmega164 is incorrect in certain versions of avrdude's avrdude.conf.
## We (try to) provide our own conf file.
## ---------------------------------------------
platino_without_library.menu.cpu.atmega164=ATmega164(A,P,PA)
platino_without_library.menu.cpu.atmega164.upload.maximum_size=15872
platino_without_library.menu.cpu.atmega164.bootloader.tool=avrdude_my_config_path
platino_without_library.menu.cpu.atmega164.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega164.bootloader.high_fuses=0xdc
platino_without_library.menu.cpu.atmega164.bootloader.extended_fuses=0xfd
platino_without_library.menu.cpu.atmega164.bootloader.file=Platino/optiboot_platino164_all_variants.hex
platino_without_library.menu.cpu.atmega164.build.mcu=atmega164p
platino_without_library.menu.cpu.atmega164.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega164.build.board=AVR_PLATINO_40PIN

## Platino with ATmega168
## ---------------------------------------------
platino_without_library.menu.cpu.atmega168=ATmega168
platino_without_library.menu.cpu.atmega168.upload.maximum_size=15872
platino_without_library.menu.cpu.atmega168.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega168.bootloader.high_fuses=0xdd
platino_without_library.menu.cpu.atmega168.bootloader.extended_fuses=0x04
platino_without_library.menu.cpu.atmega168.bootloader.file=Platino/optiboot_platino168.hex
platino_without_library.menu.cpu.atmega168.build.mcu=atmega168
platino_without_library.menu.cpu.atmega168.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega168.build.board=AVR_PLATINO_28PIN

