ElektorLabs/Arduino/source/1.1.0/boards.txt
## Platino with ATmega168P
## ---------------------------------------------
platino_without_library.menu.cpu.atmega168p=ATmega168P
platino_without_library.menu.cpu.atmega168p.upload.maximum_size=15872
platino_without_library.menu.cpu.atmega168p.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega168p.bootloader.high_fuses=0xdd
platino_without_library.menu.cpu.atmega168p.bootloader.extended_fuses=0x04
platino_without_library.menu.cpu.atmega168p.bootloader.file=Platino/optiboot_platino168p.hex
platino_without_library.menu.cpu.atmega168p.build.mcu=atmega168p
platino_without_library.menu.cpu.atmega168p.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega168p.build.board=AVR_PLATINO_28PIN

## Platino with ATmega324A|P
## ---------------------------------------------
platino_without_library.menu.cpu.atmega324a=ATmega324A|P
platino_without_library.menu.cpu.atmega324a.upload.maximum_size=32256
platino_without_library.menu.cpu.atmega324a.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega324a.bootloader.high_fuses=0xde
platino_without_library.menu.cpu.atmega324a.bootloader.extended_fuses=0xfd
platino_without_library.menu.cpu.atmega324a.bootloader.file=Platino/optiboot_platino324a_and_324p.hex
platino_without_library.menu.cpu.atmega324a.build.mcu=atmega324p
platino_without_library.menu.cpu.atmega324a.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega324a.build.board=AVR_PLATINO_40PIN

## Platino with ATmega324PA
## ---------------------------------------------
platino_without_library.menu.cpu.atmega324pa=ATmega324PA
platino_without_library.menu.cpu.atmega324pa.upload.maximum_size=32256
platino_without_library.menu.cpu.atmega324pa.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega324pa.bootloader.high_fuses=0xde
platino_without_library.menu.cpu.atmega324pa.bootloader.extended_fuses=0xfd
platino_without_library.menu.cpu.atmega324pa.bootloader.file=Platino/optiboot_platino324pa.hex
platino_without_library.menu.cpu.atmega324pa.build.mcu=atmega324pa
platino_without_library.menu.cpu.atmega324pa.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega324pa.build.board=AVR_PLATINO_40PIN

## Platino with ATmega328
## ---------------------------------------------
platino_without_library.menu.cpu.atmega328=ATmega328
platino_without_library.menu.cpu.atmega328.upload.maximum_size=32256
platino_without_library.menu.cpu.atmega328.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega328.bootloader.high_fuses=0xde
platino_without_library.menu.cpu.atmega328.bootloader.extended_fuses=0x05
platino_without_library.menu.cpu.atmega328.bootloader.file=Platino/optiboot_platino328_and_p.hex
platino_without_library.menu.cpu.atmega328.build.mcu=atmega328
platino_without_library.menu.cpu.atmega328.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega328.build.board=AVR_PLATINO_28PIN

## Platino with ATmega328P
## ---------------------------------------------
platino_without_library.menu.cpu.atmega328p=ATmega328P
platino_without_library.menu.cpu.atmega328p.upload.maximum_size=32256
platino_without_library.menu.cpu.atmega328p.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega328p.bootloader.high_fuses=0xde
platino_without_library.menu.cpu.atmega328p.bootloader.extended_fuses=0x05
platino_without_library.menu.cpu.atmega328p.bootloader.file=Platino/optiboot_platino328_and_p.hex
platino_without_library.menu.cpu.atmega328p.build.mcu=atmega328p
platino_without_library.menu.cpu.atmega328p.build.variant=arduino:standard
platino_without_library.menu.cpu.atmega328p.build.board=AVR_PLATINO_28PIN

## Platino with ATmega644(A)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega644=ATmega644(A)
platino_without_library.menu.cpu.atmega644.upload.maximum_size=64512
platino_without_library.menu.cpu.atmega644.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega644.bootloader.high_fuses=0xde
platino_without_library.menu.cpu.atmega644.bootloader.extended_fuses=0xfd
platino_without_library.menu.cpu.atmega644.bootloader.file=Platino/optiboot_platino644_and_644a.hex
platino_without_library.menu.cpu.atmega644.build.mcu=atmega644
platino_without_library.menu.cpu.atmega644.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega644.build.board=AVR_PLATINO_40PIN

## Platino with ATmega644P(A)
## ---------------------------------------------
platino_without_library.menu.cpu.atmega644p=ATmega644P(A)
platino_without_library.menu.cpu.atmega644p.upload.maximum_size=64512
platino_without_library.menu.cpu.atmega644p.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega644p.bootloader.high_fuses=0xde
platino_without_library.menu.cpu.atmega644p.bootloader.extended_fuses=0xfd
platino_without_library.menu.cpu.atmega644p.bootloader.file=Platino/optiboot_platino644p_and_644pa.hex
platino_without_library.menu.cpu.atmega644p.build.mcu=atmega644p
platino_without_library.menu.cpu.atmega644p.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega644p.build.board=AVR_PLATINO_40PIN

## Platino with ATmega1284p
## ---------------------------------------------
platino_without_library.menu.cpu.atmega1284p=ATmega1284P
platino_without_library.menu.cpu.atmega1284p.upload.maximum_size=129024
platino_without_library.menu.cpu.atmega1284p.bootloader.low_fuses=0xff
platino_without_library.menu.cpu.atmega1284p.bootloader.high_fuses=0xde
platino_without_library.menu.cpu.atmega1284p.bootloader.extended_fuses=0xfd
platino_without_library.menu.cpu.atmega1284p.bootloader.file=Platino/optiboot_platino1284p.hex
platino_without_library.menu.cpu.atmega1284p.build.mcu=atmega1284p
platino_without_library.menu.cpu.atmega1284p.build.variant=Platino-40pin
platino_without_library.menu.cpu.atmega1284p.build.board=AVR_PLATINO_40PIN

